[
	{
		"id": 1,
		"name": "Alan Grant",
        "role": "Paleontologist",
		"movies": [
			"Jurassic Park",
			"Jurassic Park III",
            "Jurassic World: Dominion"
		],
		"movieScenes": [
			{
                "id": 1,
				"movie": "Jurassic Park",
				"sceneDescription": "In Jurassic Park, Grant is a world-renowned paleontologist working at a dig site just outside Snakewater, Montana. He is described in the script as: DR ALAN GRANT, mid-thirties, a ragged-looking guy with intense concentration you wouldn't want to get in the way of. He is first seen at the dig site explaining the similarities of Velociraptor anatomy to those of modern birds; however, a bratty little boy called Eddie mocks the Raptor specimen as a 6 foot turkey. Grant silences the child by explaining in graphic detail the speculated violent hunting behavior of a Raptor. Later, Grant remarks that he hates children, alluding to why he made the effort to intimidate the boy.\n\nIn his trailer, Grant is invited by John Hammond, founder and CEO of InGen, to a theme park he built called Jurassic Park on the island of Isla Nublar. Grant and his partner Ellie Sattler accept the offer, in return of a further three years of dig funding. Soon after Grant and Sattler arrive in Isla Nublar - still unaware of what animals the Park hosts - alongside Hammond, Dr. Ian Malcolm, and Donald Gennaro, Grant is astonished and left speechless by the sight of a living, breathing Brachiosaurus.\n\nThe group is shown in the Visitor Center how dinosaur DNA was extracted for cloning, before they witness the birth of a Velociraptor. After lunch, the group embarks on a ride through the Park to see the dinosaur exhibits. The day quickly turns into an episode when Rexy escapes her paddock after Dennis Nedry sabotages the Park's systems. While siblings Lex and Tim Murphy are in danger from the T-Rex, Grant remarks to himself that the frantic kids are drawing attention to themselves with a flashlight. He and Malcolm successfully lure the T. rex away from the children, except Grant and the children must flee to safety - the Visitor Center - through a series of pitfalls. This includes fast roping down a tall concrete wall, evading a Ford Explorer falling down a 20-foot tree, running from a herd of Gallimimus, and climbing over an electric fence. After they finally reach the Visitor Center, Lex is able to use its computer room to restart all of the systems in the park. Reunited with Sattler, Grant and the children battle raptors until the T-Rex intervenes, killing the raptors.\n\nThe group escapes the Visitor Center, and Hammond and Malcolm picks them up using a staff Jeep Wrangler. Grant tells John that he has decided not to endorse the Park to Hammond's investors, and Hammond agrees with this sentiment. The group boards a helicopter, leaving the island. Grant expresses to Sattler that he has changed his attitude towards children, seeing how resourceful, courageous and moral Lex and Tim were. The group looks over the island, as Hammond gazes at his walking stick with a mosquito fossil preserved in the amber knob."
			},
			{
                "id": 2,
				"movie": "Jurassic Park III",
				"sceneDescription": "Alan appears again in Jurassic Park III. The experience on Isla Nublar has left Alan somewhat openly jaded towards dinosaurs, nearly to the point of post-traumatic stress disorder. Despite this, he continues to work as a paleontologist, this time at a dig site near Fort Peck Lake, Montana. However, the dig is cripplingly underfunded due to public interest in recovering dinosaur fossils growing diminished after the revelation of InGen's cloned dinosaurs, which Grant openly refers to as circus freaks and genetically engineered theme-park monsters, rather than true dinosaurs.\n\nHis partnership with Ellie has ended, though they remain close friends. Now he has a new partner in Billy Brennan, his paleontology colleague and apparent protege, but it is Alan who must rein in Billy's headstrong and impulsive tendencies. He visits Ellie and her husband Mark, quite pleased to spend time explaining dinosaurs to Ellie's firstborn, her three-year-old son. In a way, he envies Ellie and her happy family and wonders why he shies away from marriage and fatherhood.\n\nHe gives lectures on the intelligence of Raptors. However, his listeners are only interested in the events in 1993 and the San Diego incident.\n\nHe states that he didn't witness the latter and that nothing could get him to go to The Five Deaths (Isla Sorna/Site B). He is later bribed into going on an aerial tour of Isla Sorna by wealthy couple, Paul Kirby and Amanda Kirby. Alan invited Billy to accompany him on the trip. While they are flying over the island, Alan notices that the pilot is going to land. Alan begins to protest but is knocked unconscious by Cooper, one of the mercenaries hired by the Kirbys. When Alan wakes up, they have landed on the island already. Then after a take-off disrupted by a Spinosaurus, Alan and the others are stranded on the island. Alan soon discovers the truth that the Kirbys are not wealthy or married, but a divorced couple who were searching for their son, Eric, who was lost on the island eight weeks before, who sought Grant's help based on his adventures on Isla Nublar, unaware the island Eric had visited was Isla Sorna.\n\nAlan, using his knowledge of dinosaurs, survives with the Kirbys and an injured Billy, who had attempted to steal unhatched Raptor Eggs in the pursuit of funding for the dig site resulting in the local Raptor pack hunting the humans relentlessly in a bid to recover the stolen eggs. Despite the traumatic events of the film, his love for dinosaurs is ultimately reinvigorated after once more experiencing them firsthand. Not much is known about what happened to Grant after the incident."
			},
			{
                "id": 3,
				"movie": "Jurassic World: Dominion",
				"sceneDescription": "During a dig in Utah, Alan was reunited with Ellie. They met at his tent, where he keeps an old photo from the time they worked together in the '90s. She tells him that Giant locusts were causing the crops to drop. At first, Alan refused to help Ellie get a sample of the locust that was causing the problem, stating he was done with all of that. However, hearing that the locust could cause a disaster for the world along with seeing their old friend Ian on a front cover of a book and that he was the one who invited Ellie to come to Biosyn valley, Alan was convinced to help and accompanied his oldest friend. After arriving at Biosyn, Alan and Ellie meet Ramsay Cole and Lewis Dodgson, the CEO of Biosyn.\n\nAlan and Ellie reunited with Ian as they gave them a key that would help them get the sample of the locust. Alan and Ellie were successful in getting the sample but were nearly killed when the insects swarm around them. However, Alan and Ellie managed to escape from them then meet a teenage girl named Maisie Lockwood, who had been kidnapped by Biosyn but escaped, as they leave the building together. Through the help of Ramsay, Alan, Ellie and Maisie escape through a hyperloop. However, after the hyperloop came to a stop, Alan, Ellie and Maisie leave it as they discovered that they're in a mine. While looking for a way to get out of the mine, Alan calmed a panicked Ellie down then tells her that he wasn't happy with the life he had, which surprised her.\n\nWhen asked by Maisie if they were together, Alan and Ellie told her they were not but they're still friends. Through the help of Ian, Alan, Ellie and Maisie escaped the mine. Alan and the group leave in the car that Ian brought with him. However, they discovered that Biosyn was destroying evidence through a fire in a group of insect, but managed to get away from them. After falling over inside the car, Alan, Ellie and Ian see three people in front of them at a research outpost, but Maisie recognized two of them as her adoptive parents. As she exited the car to embrace her family, Alan, Ellie and Ian exited the car as Maisie told her parents that they rescued her, much to their gratitude. However, they were attacked by a Giganotosaurus but were able to escape its attack. While regrouping, Alan and Ellie were given some water by Maisie's father as he introduced himself as Owen Grady.\n\nAlan was flattered to hear that Owen is a fan of his and read his book on tape, he then recognized him as one of the Raptor trainers at Jurassic World. While Ellie left with Maisie's mother, Claire Dearing, to bring power back online to safely leave Biosyn, Alan reluctantly accompanied Owen and Maisie in retrieving Beta, a baby Raptor that belong to Blue, a Velociraptor that Owen trained. Once they found her, Alan witness Maisie use what her father taught her about handling Raptors to ensure Beta only had her eyes on her. Seeing this, Alan was inspired to help them as he and Owen triangulate while Maisie kept Beta eyeing on her so her father can knock her out, which they were able to do. After getting Beta, Alan and the group meet up with Henry Wu as he recognized him as one of the scientists in Jurassic Park decades earlier.\n\nAlan and the group were unsure of trusting Henry, but Maisie convinces them to give him a chance. The group encounters the Giganotosaurus again who fights with Rexy, the old T. Rex from Jurassic Park who had been encountered nearly thirty years before by Grant, Ellie and Ian during the original Jurassic Park incident. With help from a Therizinosaurus, Rexy kills the Giganotosaurus as the group escapes from Biosyn. After leaving Biosyn, Alan and Ellie renew their relationship and go to Washington D.C. to testify against Biosyn alongside Ian and Ramsay."
			}
		],
		"link": "https://jurassicpark.fandom.com/wiki/Alan_Grant"
	},
    {
        "id": 2,
        "name": "Ian Malcolm",
        "role": "Chaotician",
        "movies": [
            "Jurassic Park",
            "The Lost World: Jurassic Park",
            "Jurassic World: Fallen Kingdom",
            "Jurassic World: Dominion"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic Park",
                "sceneDescription": "Ian Malcolm was invited to the park by Donald Gennaro as an insurance consultant as Donald apparently felt that Ian, as a fiduciary, would be able to notice any dangerous shortcomings the park had. On the helicopter ride to Isla Nublar, he met John's consults, Paleobotanist Ellie Sattler and Paleontologist Alan Grant, and travelled with them, along with John and Donald, into the park where he was stunned by the astonishing sight of a living Brachiosaurus. He then travelled to the Visitor Center and learned how the dinosaurs of the park were created and watched an infant Velociraptor hatch. While his colleagues remained in awe of the event, Ian expressed scepticism of the Park's ability to control the animals they were breeding, and explained to his colleagues that life finds a way. Ian later went on the tour through the Park only to express disapproval when none of the dinosaurs showed themselves. Bored, he took to flirting with Ellie, much to Alan's dismay, while attempting to explain chaos theory. After watching a sick Triceratops, he returns to the tour with Alan Grant, only to have it break down in front of the Tyrannosaur paddock. Rexy escapes and attacks the tour vehicle, which Donald had earlier abandoned with the children inside. In an attempt to lure Rexy away, Ian and Alan use flares to cause a distraction, but Ian deliberately keeps moving after throwing his flare in order to lure her further away so that Alan can rescue the children. Ian is chased to the bathroom, where he is tossed several feet and injures his leg before becoming unconscious.\n\nDespite this, Ian was fortunate enough to be hidden from Rexy's sight after being covered in leaves following the bathroom's destruction, though the same cannot be said for Donald, who ends up being devoured by the Rex. Alan escapes with the kids and Ellie and Robert Muldoon arrive to help Ian, only to be set upon by Rexy. Having put Ian aboard the jeep, they escape after a short but intense chase. Eventually, Alan finds out that the dinosaurs are capable of breeding themselves in a single-sex environment thanks to the frog DNA, making him realize that Ian was correct about life finding a way.\n\nIan is brought to the control room where he helps formulate a plan to restart the power. Ian is brought to a bunker where he and John talk Ellie through the process of turning the power back on. After the systems come back online, Ian and John drive back to the visitor's center to pick up Alan, Ellie, and the kids, all of whom then drive to the helicopter, leaving the island. Afterwards, he was taken to a hospital in Costa Rica to treat his injuries. His girlfriend Sarah Harding went out looking for him."
            },
            {
                "id": 2,
                "movie": "The Lost World: Jurassic Park",
                "sceneDescription": "After the events of the Isla Nublar Incident, InGen and Ludlow made Malcolm a generous compensatory offer for his injuries. However, Malcolm attempted to go public about his experience on Isla Nublar, only to be discredited by Hammond's nephew, Peter Ludlow, who made Malcolm appear insane to the public. This was further complicated by Malcolm being in open violation of the non-disclosure agreement he signed prior to the Incident, further damaging his tarnished career. Malcolm also had his University tenure revoked for telling wild stories to the press.\n\nDespite these events, Malcolm managed to develop a relationship with an accomplished biologist named Sarah Harding. By then Malcolm is a shell of his former self, openly mocked in public and no longer expressing his beliefs in Chaos Theory.\n\nMalcolm is eventually summoned to John Hammond's mansion, where he meets Hammond, who has resigned as founder and CEO of InGen. Hammond reveals to Malcolm the nature of Site B; a separate island where the dinosaurs were bred before being moved to the main island. Hammond then unveils his plan to send a team of researchers to the island to photograph the animals in their natural habitat in order to create public sympathy and discourage corporations, such as Ludlow's InGen, from profiting off the island. Malcolm, who is invited along, initially declines but changes his mind when Hammond reveals that Sarah was also hired and has already left for the island. Malcolm then meets up with Hammond's other men, Eddie Carr and Nick Van Owen, and makes preparations to leave for the island.\n\nUpon arrival, the team immediately begins searching for Sarah using a satellite phone, and eventually find her following a herd of Stegosaurus. After a brief encounter with the creatures, they return to the trailer, where Malcolm finds out that his daughter, Kelly, has stowed away on board. He attempts to convince Sarah to leave with him but is interrupted when a fleet of helicopters bearing the InGen logo and carrying various automobiles arrive over the island. The team follows the new arrivals and watch as they chase down various dinosaurs in jeeps and capture several of the creatures. That night, they watch as Ludlow, who is in charge of the group, gives a presentation with a live stream to his shareholders and announces his plan to recreate Jurassic Park in San Diego. He is interrupted however when Sarah and Nick set the captive dinosaurs loose from their cages, destroying the camp. In an attempt to avoid the chaos, Malcolm takes Kelly back to the trailer, and later, to the high-hide when Sarah and Nick arrive at the trailer with an injured infant Tyrannosaurus. However, after hearing the unmistakable bellows of the infant's parents, Malcolm leaves the safety of the High Hide and runs on foot back to the trailer just as the adult Tyrannosaurs arrive, and helps return the healed infant to its parents. However, the Tyrannosaurs remain unimpressed and, seeing the trailer and its inhabitants as a threat, promptly push the trailer until it hangs precariously over a cliff. After barely saving Sarah from falling, Malcolm and Nick are rescued by Eddie Carr who, in the process, is brutally devoured by the Tyrannosaurs.\n\nThe three are then helped back onto the cliff by Roland Tembo, who is in charge of Ludlow's team. With all of InGen's equipment and automobiles destroyed, Roland decides that an uneasy alliance is the best method for escaping the island. Reunited with Kelly, Malcolm and his team agree to trek to the abandoned facility at the island's center. Along the way, Malcolm attempts to coerce Ludlow into realizing the error of his ways, but is unsuccessful. That night, the team is set upon by the Tyrannosaurs, who followed the smell of the infant T.rex's blood on Sarah's jacket. The team is separated in the chaos, with most of them being chased in a massive stampede to a waterfall. Malcolm, Sarah, Kelly, and Nick end up separated from the InGen group, who are ambushed by Velociraptors in the long grass surrounding the facility. The four make it through the grass unharmed, but Ian is briefly hurt and Nick goes on ahead to call for help. Eventually Ian, Sarah, and Kelly follow, only to be attacked by three raptors. They eventually escape the compound where they board a helicopter that Nick called in, departing the island for good.\n\nUnfortunately, however, their troubles are not yet over as they eventually find that Tembo has tranquilized the buck Tyrannosaur, and the team are bringing it back to the mainland. Ian and Sarah try to visit the dock where Ludlow is holding a press conference when the freighter (S.S. Venture) holding the animal suddenly crashes through the dock at extreme speed, releasing the Rex. As the animal goes on a rampage through San Diego, Malcolm and Harding drive to the site of the new Park and retrieve the infant. They then find the father and lure him away using the infant. After a brief chase, they bring the animals back to the freighter and drop the infant in the cargo bay, where it is followed by an embittered Ludlow, as well as the adult Rex, who mutilates Ludlow with the infant finishing the process of executing him. Malcolm then re-boards the ship and closes the cargo bay, locking the beast inside.\n\nIn the aftermath, Malcolm is last seen resting on his couch with Sarah, while Kelly watches a news program showing the freighter returning to the island and Hammond convincing the governments to keep Isla Sorna as a private natural reserve for the dinosaurs. With the truth about the dinosaur incidents finally exposed to the public, Malcolm's reputation is restored and he is praised as a hero."
            },
            {
                "id": 3,
                "movie": "Jurassic World: Fallen Kingdom",
                "sceneDescription": "Ian Malcolm appears for the first time in 21 years, testifying before a congressional committee. He talks to the committee about whether Nublar's dinosaurs should be rescued or not from Mt. Sibo's eruption. Malcolm then confessed that the dinosaurs should not be rescued because doing so would lead more untold chaos to the mainland, stating that the humans have this great technology in cloning extinct animals in their hands and that they are unable to control it.\n\nDespite this, the dinosaurs ended up in the mainland, and untold incidents start to occur due to the dinosaurs' presence. Malcolm reappears at the committee in the end, stating a new era will arrive and the dinosaurs will have to coexist with the humans (and other animals), otherwise they will all go extinct. Malcolm states that the dinosaurs are inbuilt survivalists who survive off of nature, but humans expect things to stay the same and are resistant to change whereas animals and dinosaurs can adapt which means they must adapt, or nature will continue as the humans die off. As a bit of intentional irony, harkening back to both John Hammond's famous greeting and the name of the former park, he then delivered the film's final line. Welcome to Jurassic World."
            },
            {
                "id": 4,
                "movie": "Jurassic World: Dominion",
                "sceneDescription": "Ian now works as an in-house philosopher for Biosyn and his theories have become incredibly popular given the current state of the world with the dinosaurs. He has published a book titled How The World Will End. Ian invites his old friend Ellie Sattler to the Biosyn Sanctuary where he proves himself to be knowledgeable about the threat of the giant locusts and Biosyn's role in it. Ian helps Ellie and Alan Grant sneak into the labs to get a DNA sample. Ramsay Cole later reveals to the two that he had told Ian the truth about Biosyn's plot and enlisted his help to stop it.\n\nAfter Alan and Ellie's actions are discovered, Lewis Dodgson quickly deduces Ian's role in things and fires him for it. Ian publicly berates Dodgson in front of his employees, revealing to them Dodgson's greed and the lengths that he will go to in order to fulfill his plans, later causing them to turn on Dodgson. Ramsay helps Ian escape and rescue Alan, Ellie and Maisie Lockwood from a group of Dimetrodon in the Sanctuary's Amber Mines. Linking up with Owen Grady's group as the sanctuary catches on fire, they come under attack by a Giganotosaurus and Ian successfully distracts it away from the others using a flaming locust.\n\nReturning to the control room, Ian and Ramsay work together to guide Ellie and Claire Dearing through shutting down the primary systems in order to reactivate the ADS so that they can escape in a Biosyn helicopter, although Ian has trouble conveying the correct directions to the two women. Reuniting with the rest of the group, Ian is less than pleased to see Dr. Henry Wu again, angrily complaining that it's always him. During the escape, when Rexy is nearly killed by the Giganotosaurus, Ian joins his friends in distracting the Giganotosaurus in an effort to save Rexy's life. The distraction gives a Therizinosaurus time to join the fight and help Rexy kill the Giganotosaurus.\n\nAfter reaching an airfield, Ian gives an interview to reporters on the situation alongside Ramsay. He also joins Ramsay, Ellie and Alan in testifying before the Senate on Biosyn's actions."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Ian_Malcolm"
    },
    {
        "id": 3,
        "name": "Ellie Sattler",
        "role": "Paleontologist",
        "movies": [
            "Jurassic Park",
            "Jurassic Park III",
            "Jurassic World: Dominion"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic Park",
                "sceneDescription": "Dr. Ellie Sattler was Alan Grant's partner and girlfriend and worked with him at the dig site in Montana. She had a Ph.D in Paleobotany. She was described in the script as: Ellie in her late twenties, athletic-looking. There's an impatience about Ellie, as if nothing in life happens quite fast enough for her. Early in the film, it was shown that Ellie wanted to have children, while Alan was against the idea entirely as he dislikes kids.\n\nEllie and Alan were asked by John Hammond to visit, and hopefully endorse, Jurassic Park. Alan and Ellie first met Hammond in their trailer opening a bottle of champagne. Ellie called Hammond inconsiderate but apologized after hearing what Hammond has to offer them. In return, Hammond promised to fund their dig site for the next three years. Once on the island, Ellie, like a true Paleo-botanist, immediately noticed that Vermiform plants, which are extinct, were growing next to the road. She was so enthralled with this prehistoric plant that she did not notice that the Jeep she was riding in had stopped alongside a Brachiosaurus, only doing so when Alan physically turned her head to see it. Though initially overwhelmed with wonder at the park, Ellie soon had misgivings about the whole thing, particularly in regards to the deadliness of the plants and animals in the park, voicing her opinion that they were picked because they were pretty but were also dangerous creatures that would defend themselves aggressively if they felt threatened.\n\nAt the start of the Park Drive, she tried to get Alan and Lex to ride in the same car, so that he could get used to children. When they arrived at the Triceratops Enclosure, she was amazed by the ill Triceratops they found, shedding tears of joy. Bringing in her skills, Ellie probed deeper into the Triceratops periodic sickness and came to the conclusion that it was because they ate the poisonous West Indian Lilac plants in their territory, though could not initially determine how since the animals didn't ingest the plants themselves.\n\nBecause she stayed in the Triceratops Enclosure, she was not attacked by Rexy like the rest of the group. She later joined Robert Muldoon as he went to the Tyrannosaur Paddock to rescue the survivors, finding one missing tour jeep and what Rexy had left of Donald Gennaro. The only survivor in the area turned out to be Ian Malcolm, who was badly wounded. While Muldoon loaded Malcolm into the back of the Jeep, Ellie continued to search the area for any sign of Grant or the children. She spotted the other car, tossed over the edge of the barrier to the Tyrannosaur paddock. When they inspected the wreckage, she found footprints leading off into the park. This piece of evidence gave Ellie hope that Grant and the kids were still alive. When Ellie and Muldoon returned to the Jeep, the Rexy burst from the trees after them. Rexy then chased behind their car until they could outdistance it. Once they returned to the park, Ellie gave Malcolm a dose of morphine and tried to convince John Hammond that the park wasn't viable because the creatures were uncontrollable.\n\nAfter Ray Arnold shut down Jurassic Park's main electricity, hoping to bring all the systems back online during the manual restart, Ellie and Muldoon set out after him to the Power Shed to set up the electricity again. Though Hammond thought that he ought to be going in Ellie's place, she was not amused and insisted on going herself, stating that they could discuss sexism in survival situations on her return. On the way there, they discovered that the shutdown must have turned off all the fences, including the fences of the raptor paddock. Soon after this realization, Ellie and Muldoon became aware that they were being hunted by the raptors. While Muldoon stayed behind to give her cover from the escaped Velociraptors, she sprinted to the shed. She was able to activate the power again and delightedly proclaimed them to be back in business, only to be immediately scared out of her wits when a raptor suddenly attacked her from behind. Managing to briefly trap it behind a wire-mesh door, Ellie stumbled backwards from it in horror and felt an arm land on her shoulder. Assuming it to be Mr. Arnold, Ellie looked around for him only to find that the arm was all the raptors had left of him. Fleeing with the lethal predator almost literally on her heels, Ellie made it out of the shed and into the jungle, sobbing in fear. Muldoon, meanwhile, wasn't as fortunate; he obviously didn't know about the raptors' plan of attack: one raptor waits in plain sight and distracts their prey while one or two more raptors come at them from the sides, and he was caught off-guard and killed.\n\nDiscarding her pink over-shirt, Ellie went back to the bunker and rendezvoused with Alan on the way. Together, Ellie and Alan returned to the Visitor's Center and saved the children. She then helped Alan block the door to the control room, preventing the remaining raptor from breaking in while Lex attempted to reboot the system from the computer. The raptor then broke in through the control room's glass window and the group rushed to escape through the air ducts. In the Visitor Center lobby, the raptors closed in on them and were preparing to attack when Rexy burst in and lifted a raptor off the floor in her jaws, killing the raptor. In an outrage, the last raptor attacked Rexy. Taking advantage of this diversion, Ellie and the rest of the group exited the visitor center. Hammond and Malcolm were waiting for them in the Jeep and the group drove off to the helipad. On their flight home, Ellie was happy to see that Alan was sitting between the two sleeping kids, realizing that the horrible experience had at least softened his dislike of children."
            },
            {
                "id": 2,
                "movie": "Jurassic Park III",
                "sceneDescription": "Ellie braved the horrors of Jurassic Park with Alan 8 years ago and came out of the experience. But Grant's first love was and continued to be dinosaurs. At some point, Ellie and Alan broke up and Ellie began a relationship with Mark Degler, an employee of the State Department, who she subsequently married. They had two children, whom they lived with in Washington, D.C.. She had become a children's writer, though was quite stubborn on certain quotes her editor felt were unwise.[3] Ellie and Grant remained very close friends, with Alan often stopping by to visit the Deglers and being referred to as the dinosaur man by Ellie's young son. The two still shared the same interest in paleontology despite Ellie no longer being active in that field, though Ellie was less enthusiastic about raptor research considering her past experiences.\n\nEllie remained very loyal to Alan, telling him that he was still the best in his field and that he could call her about anything at any time. Despite them no longer being in a relationship, she appeared to still care deeply for Alan as a result of their long history together. Ellie's son had dragged the phone Alan was calling on to get to his mother, who was told by Alan that he and the search party are lost on Site B at the river. Mark Degler's connection to the State Department helped them get the US Marine Corps to rescue them from the island. Alan, relieved to be saved, breathes God bless you, Ellie. At one point, Alan admitted to Eric Kirby he doesn't thank Ellie often enough for what she does for him and is reminded that he's really going to have to thank her now."
            },
            {
                "id": 3,
                "movie": "Jurassic World: Dominion",
                "sceneDescription": "After getting a call of a swarm of giant locusts eating crops, Ellie arrived at the site in West Texas to investigate. Seeing that another crop area wasn't touched, Ellie figured out that Biosyn was responsible for this. Ellie then went to her former lover and friend Dr. Grant for help in a dig site in Utah. While catching up with Alan, Ellie told him that she and Mark divorced and their two children were in college. When Alan asked her why she brought the locust to him, Ellie tells him that she wants to prove that Biosyn was responsible for engineering these insects and needed a witness. Ellie then tells Alan that she was invited to Malcolm's lecture at Biosyn headquarters, where they would get a sample of a locust out of Biosyn's laboratory. After arriving at Biosyn, Ellie and Alan meet Ramsay Cole and Lewis Dodgson (the same man who met Dennis Nedry at the San Jose, Costa Rica restaurant), the head of the company. Ellie and Alan reunited with Ian as he gave them a key that would help them get the sample of the locust.\n\nEllie and Alan were successful in getting the sample, but were nearly killed when the insects swarm around them. However, Ellie and Alan managed to get away from them, then meet a teenage girl named Maisie Lockwood, who had been kidnapped by Biosyn but escaped, as they leave the building together. Through the help of Ramsay, Ellie, Alan and Maisie escape through a hyperloop. Realizing that Maisie is the daughter of Charlotte Lockwood, Ellie tells her about her biological mother while riding on the hyperloop. However, after the hyperloop came to a stop, Ellie, Alan and Maisie leave it as they discovered that they're in the amber mine.\n\nWhile looking for a way to get out of the mine, Ellie expressed regret in dragging Alan into this, but he tells her not to feel that way as he wasn't happy with the life he had, much to her surprise. When asked by Maisie if they were together, Ellie and Alan told her they were not, but they're still friends. Through the help of Ian, Ellie, Alan and Maisie escaped the mine. Ellie introduced Maisie to Ian as they and Alan leave in the car that their friend brought with him. However, they discovered that Biosyn was destroying evidences through a fire in a group of insect, but managed to get away from them.\n\nAfter falling over inside the car, Ellie, Alan and Ian see three people in front of them, but Maisie recognized two of them as her adoptive parents as she exited the car to embrace her family. Ellie, Alan and Ian exited the car as Maisie told her parents that they rescued her, much to their gratitude. However, they were attacked by a Giganotosaurus in a research outpost, but got away from it. While regrouping, Ellie and Alan were given some water by Maisie's father as he introduces himself as Owen Grady. Hearing his name, Ellie and Alan recognized Owen as one of the employees at Jurassic World.\n\nEllie accompanied Maisie's mother, Claire Dearing, to bring power back online in order to leave Biosyn. While getting to power lines, Ellie talks with Claire as she tells her that she still gets nightmares from her experiences at Jurassic Park. Hearing that Claire has a lot of regrets about her actions in Jurassic World, Ellie helped her realize that she can't keep holding onto regret. After bringing power back, Ellie and the group meet up with Henry Wu as she recognized him as one of the scientists in Jurassic Park. Ellie and the group were unsure of trusting Henry but Maisie convinced them to give him a chance.\n\nAfter leaving Biosyn, Ellie and Alan renew their relationship as they go to Washington, D.C. to testify against Biosyn with Ian and Ramsay."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Ellie_Sattler"
    },
    {
        "id": 4,
        "name": "Dennis Nedry",
        "role": "Computer Programmer",
        "movies": [
            "Jurassic Park"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic Park",
                "sceneDescription": "Dennis was hired by InGen as a computer programmer for Jurassic Park. At one point, Dennis was having serious financial problems and began to reveal that InGen wasn't paying him enough to do his job. John Hammond was aware of this, but believed that Dennis was a full-grown man who could fight his own battles, as he later remarked Your financial problems are your own. Dennis decided to accept an offer to commit industrial espionage for Lewis Dodgson to steal InGen's dinosaur embryos, which would grant BioSyn a competitive edge. In exchange, Dodgson would give Dennis a $1.5 million windfall. The two met at an outdoor food court in San Jose, Costa Rica for lunch, where Lewis Dodgson gave Dennis half of his payment and a modified Barbasol can, which manned a secret compartment designed to hold 15 dinosaur embryos for 36 hours. Lewis also covered the cost of Nedry's meal because of his full cooperation.\n\nAfterward, Dennis returned to Isla Nublar to go back to work, waiting until night to make his move. To access the Cold Storage Room undetected, he would need to create Whte rbt.obj, a backdoor that would deactivate nearly all of Jurassic Park's security except the Raptor Pen. He initiated his plan after he received a call from one of Lewis Dodgson's agents at Isla Nublar's dock who told him that he would be departing the island soon because of the storm, despite Dennis wanting to do more testing on Whte rbt.obj.. Just before executing his malicious program, Dennis alerted his colleagues that he was going to get a soda and that some of Jurassic Park's systems might be deactivated because they were compiling files so he wouldn't raise any suspicions, initiating the catalyst of the Isla Nublar Incident of 1993.\n\nWith the security deactivated and with most of Jurassic Park's workers gone to escape the storm, Dennis accessed the Cold Storage Room where he filled the modified Barbasol can with dinosaur embryos. He then proceeded to escape the Visitor Center using Jeep 12, traveling to the East Dock to drop off the Barbasol can and to get the rest of his payment. However, heavy rainfall disoriented him and also got himself lost in the wilderness, while he was driving on his way to C-3028 ship at the docks, causing him to drive off the road and accidentally crash into a fallen tree in the nearby forest. Dennis responded to this situation by getting out the jeep's rope tow to get it unstuck. While unraveling the car tow, he slipped on the mud he was standing on, which led to him losing his glasses, but something far worse was going to happen to Dennis. While tying the rope to the closest tree, a juvenile Dilophosaurus tethered around. When he deactivated nearly all of the park's security, it deactivated many of the security fences that kept the dinosaurs from escaping their paddocks (except for the Raptor Pen as Dennis knew how dangerous the raptors were), allowing dinosaurs, like Dilophosaurus, to roam freely.\n\nDennis became uneasy upon noticing the curious Dilophosaurus that was roaming around and quickened his pace, though eventually halted his task temporarily to deal with it. Perturbed and not knowing what to do, Dennis illogically tried to distract it by getting her to play fetch, but the Dilophosaurus didn't seem to care by the stick he threw. Frustrated at his ruse failing, Dennis insulted the Dilophosaurus before proceeding to return to his vehicle, only for him to nearly slip again. When he looked back, the Dilophosaurus (having followed him) opened its frill and began intimidating him, spraying tar-like venom at him. Lucky for him, the venom missed and mostly hit his shirt, so Dennis was able to crawl away and to reach the door to his vehicle. However, the Dilophosaurus unleashed another barrage and landed a bullseye onto Dennis' face. He screamed in agony and desperately tried to get in his jeep as his eyes burned from the poison, but he knocked his head on the roof of the jeep, causing him to accidentally drop the modified Barbasol can and it got washed away by the raging waters.\n\nImmediately afterward, Dennis managed to get inside his vehicle and shut the door. Just as he thought he was safe however, he quickly saw to his horror that the Dilophosaurus had stowed aboard into the passenger seat. With nowhere to run, Dennis could only scream in terror and agony as the small therapod mauled him to death."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Dennis_Nedry"
    },
    {
        "id": 5,
        "name": "John Hammond",
        "role": "CEO of InGen",
        "movies": [
            "Jurassic Park",
            "The Lost World: Jurassic Park"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic Park",
                "sceneDescription": "In the film, John Alfred Hammond is a flamboyant venture capitalist from Scotland, building his fortune in Petticoat Lane, England. He also held parks in Kenya, Costa Rica, and other tropical locations.\n\nThe only similarities of the film's Hammond to the novel's Hammond are eccentricity and value for money but he is not as much of a dark character. While the novel's Hammond is cold, ruthless and in many ways the stereotypical businessman (i.e., uncaring about people, Machiavellian in his attempts to control his creation), the film's Hammond is affable and kind and is genuinely concerned about the well-being of his grandchildren and the other visitors as well as his employees at the park. He also cares about his dinosaurs at the same time, but understands the circumstances when the park fails. The novel's Hammond's personalities are seen instead in Donald Gennaro.\n\nThe turning point for film's Hammond is when Ellie Sattler bluntly tells him that he never had control and that the only thing that matters now is the survival of the people they love. Hammond is visibly struck by Ellie's words and spends the remainder of the film doing whatever he can to make sure that they all survive Jurassic Park. Unlike his novel appearance, John escapes Jurassic Park and agrees with Dr. Grant that the park was a failure and should not be endorsed, though he was understandably depressed about the failure.\n\nSeveral days after Hurricane Clarissa, Hammond found out that Lockwood's infertile daughter Charlotte Lockwood is using the cloning technology as a means of undergoing trials to create a child of her own. Hammond disagrees with Charlotte's intentions as he opposes human cloning, finding it to be 'unholy', but Lockwood defends his daughter's actions, resulting a fallout between Hammond and Lockwood. With the partnership ended, Hammond takes full control of InGen while Lockwood is left at his manor in seclusion."
            },
            {
                "id": 2,
                "movie": "The Lost World: Jurassic Park",
                "sceneDescription": "Four years after the Isla Nublar Incident, John has resigned from his role as CEO of InGen and passed the baton over to his nephew, Peter Ludlow. He had become a naturalist rather than continue being an industrialist. John is seen in his lavish mansion, clearly declining in health. He was seen talking with Ian Malcolm about sending a team to Isla Sorna to document the animals. Ian becomes concerned when John revealed that he had allowed his girlfriend Sarah Harding to go to Isla Sorna, but reluctantly goes. He is briefly seen in the San Diego Incident CNN broadcast saying that the dinosaurs should be left alone on Isla Sorna and ends with Ian's quote, life will find a way."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Ellie_Sattler"
    },
    {
        "id": 6,
        "name": "Owen Grady",
        "role": "Animal Behaviorist",
        "movies": [
            "Jurassic World",
            "Jurassic World: Fallen Kingdom",
            "Jurassic World: Dominion"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic World",
                "sceneDescription": "During the training of Blue's pack and just before the Jurassic World incident, a new worker to the paddock accidentally fell inside the enclosure of the Velociraptors when he was trying to rescue a stray pig. Owen quickly rushed inside the paddock despite his fellow trainer Barry not wanting him to as the raptors cornered the worker. After commanding the Raptor Paddock's security not to fire their taser rifles, Owen confronted his pack allowing Barry to drag Leon out of the enclosure and Owen calmed down his raptors. Three weeks before the Indominus rex Paddock became open to the public, he was offered a job by Claire Dearing to check the paddock for any security breaches. He went to visit the paddock with Claire, only to find the Indominus rex not in her paddock, believing that the claw marks on the paddock's wall to be evidence that she seemingly escaped. So he, Nick Kilgore, and the paddock's supervisor, Nicholas Letting, went inside to investigate. Much to their horror, they discovered that the Indominus was still in her enclosure and had set a trap for them.\n\nHe evaded the hybrid by hiding under a crane just outside the paddock and cutting the fuel tank to cover his scent, but the two men he was with were devoured by the I. rex. Afterward, he traveled to the Control Room in an embittered matter, where he watches the progress of two Asset Containment Unit teams called to capture the hybrid, only for nearly all of them to be slaughtered by the creature. Concerned for the whereabouts of her two nephews, Claire asked Owen to go with her to the Gyrosphere Valley to go and look for them.\n\nHe accepted her request and the two drove to the attraction in Mercedes 05 where they found a damaged Gyrosphere 07 as well as 6 Apatosaurus, 5 of which were dead and one they witnessed dying. Owen noticed that none of the Apatosaurs showed signs of having been eaten and concluded that the Indominus rex was killing for sport. They then went into Isla Nublar's Restricted Area to search for the Mitchell brothers after finding their footprints in the mud on top of a waterfall. They soon ran inside the abandoned Visitor Center made for Jurassic Park upon hearing the engine of an automobile nearby.\n\nOnce he and Claire were inside, they discovered that the boys had repaired one of the old Jeep Wrangler Staff Vehicles that was being kept in the garage. But while they were in the old center, the Indominus rex discovered them and began to chase them. However, her hunt of the two humans ended when the hybrid became distracted by the approaching helicopter JW001 that was trying to kill her. Owen and Claire then witnessed the deaths of Simon Masrani and the passengers of JW001 as well as the fleeing pterosaurs that followed. As the two saw the pterosaurs flying through the breach in the dome, they fled to the trees for cover.\n\nOwen and Claire headed to Main Street and he started shooting the pterosaurs along with the Asset Containment Unit. Owen was attacked by a Dimorphodon that tried to kill him, leading Claire to grab his rifle and shoot the pterosaur to put it to sleep. Then afterwards, the two kissed each other in the street.\n\nOwen headed back to the Raptor Research Arena and revealed that Vic Hoskins planned to use Blue, Charlie, Echo, and Delta to attack the Indominus. Owen, at first, hated this idea but then decided it was the only way. After he lured the raptors with the tracker the I. rex clawed out and rode his Triumph Scrambler motorcycle along the raptors, where they found the Indominus. However, she communicated with the raptors and became the alpha of their pack as Owen realized the I. rex has Velociraptor DNA. As the leader of the pack, she commanded the raptors that were under her control to attack the humans that came with them and were in the area, to which they followed this order. After Charlie killed an InGen Security Division trooper, she saw Owen who refused to shoot her. Seconds later, one of the InGen troopers fired a missile launcher at her, killing Charlie, much to Owen's remorse. He then distracted Blue from attacking Barry who had run to a nearby log to evade her.\n\nUpon regrouping with Claire, Zach, and Gray at the Innovation Center, Owen, Claire and the boys made their way into Henry Wu's lab, only to find some InGen Security personnel taking all of Wu's hybrid embryos during the evacuation protocol. They eventually found and confronted Hoskins, who confessed his involvement with the incident and his plans to have some dinosaurs weaponized for the military with Wu's collaboration, including a planned, scaled-down version of the I. rex. Before he could continue, however, Delta, having stealthily followed Claire and her nephews, appeared. Owen, Claire and the Mitchell brothers were then forced to flee after the raptor killed Hoskins, who failed at trying to calm her down by copying Owen's hand gesture.\n\nLater, upon exiting the Innovation Center, Owen's group were cornered by Blue, Echo, and Delta at Main Street. Owen managed to calm Blue down long enough for him to remove the head-mounted camera from her head, thereby regaining the raptor's trust. When the I. rex suddenly appeared and ordered the raptors to kill the remaining humans, Blue, and her packmates had a change of heart and decided to protect Owen from the hybrid. The I. rex retaliated by hurling Blue into a concrete wall for her defiance, seemingly killing her. Having regained his position as their alpha, Owen commanded Echo and Delta to attack the I. rex, while he provided cover fire. Unfortunately, Echo and Delta were overpowered and defeated by the I. rex in the ensuing fight; with Delta being incinerated after being thrown into the steakhouse's grill, and Echo getting tossed away.\n\nWith his raptors dead, Owen now shifted his focus on protecting Claire's nephews, while she, due to a realization from Gray, went to summon Rexy from her paddock to battle the I. rex. Owen and her nephews barely escaped the attack from the two gargantuan, and Rexy was also overpowered by the hybrid. However, before the I. rex could kill her, they witnessed the surprise return of Blue, having managed to survive her earlier attack, and both Blue and Rexy teamed up to attack the hybrid head on, while Owen, Claire and her nephews tried to evade the battle. After being flung to the edge of the park's lagoon where Rexy and Blue cornered her, the I. rex eventually met her demise when the park's resident Mosasaurus jumped out of the water and dragged her under the water. Rexy decided to spare Blue's life, and Owen decided to release her into the wilderness.\n\nIn the hanger on the Costa Rican mainland, Owen was tending to some of the survivors before turning to Claire. When Claire asked what should they do now, Owen insisted that they should probably stick together for survival, before they leave together."
            },
            {
                "id": 2,
                "movie": "Jurassic World: Fallen Kingdom",
                "sceneDescription": "After the incident, Owen becomes a recluse and moves to the mountainside, where he is singlehandedly constructing a cabin. As a result, he and Claire broke up again, as she went on to create the Dinosaur Protection Group and knew Owen was trying to run away from what transpired three years prior. Sometime after their split, Claire tries to recruit Owen in relocating the last Velociraptor, Blue, with whom he shared a close relationship with, to a sanctuary for dinosaurs. However, Owen, wishing to sever his connections to Jurassic World, initially acts indifferently at the news of Blues survival and Claires warnings that Blue will perish, since the island was about to explode. Despite this, he ends up accompanying Claire out of concern for Blue and lingering feelings for Claire.\n\nBack on the island, Owen manages to find Blue but is betrayed by Eli Mills's men. They shoot Blue and sedate Owen, leaving him alone in the wild while they cart Blue back to the ship. Owen wakes up and finds Claire Dearing and Franklin Webb as the island explodes. The three of them sneak onto the ship carrying the dinosaurs as it's leaving the island. They learn that the dinosaurs are being taken back to be auctioned off to the highest bidder. Together, Claire and Owen drive to the Lockwood Manor to stop the auction but are apprehended by Eli's men. They are locked up and fail to stop the auction. Owen comes up with the idea to have the Stygimoloch next to them knock the wall down and the two of them escape. They run into Maisie Lockwood and together they go to the auction room. Owen leaves the girls behind as he goes to stop the auction with the help of the Stygimoloch. He reunites with the girls, but they run into Eli. Owen learns that Maisie is a clone of Benjamin Lockwood's daughter. The Indoraptor, having escaped, attacks and chases them around the main floor of the manor.\n\nMaisie gets separated from Owen and Claire. Claire is injured, but tells Owen to go after Maisie. He takes the gun and runs after her. He finds Maisie in her room with the Indoraptor poised to attack. He fires at the dinosaur but it does nothing and just as the Indoraptor is going to attack Owen, Blue appears. The two dinosaurs have it out while Owen and Maisie escape out the window. The Indoraptor comes after them and corners Owen and Maisie on the edge of the roof. Claire comes up behind him and prompts the dinosaur to attack by pointing a laser at Owen. The Indoraptor goes after him but the rooftop breaks and it almost falls through. It pulls itself back up and goes for Owen again until Blue arrives and pushes the Indoraptor through the opening. The three of them go downstairs and learn that the dinosaurs are dying due to the ventilation being broken. Claire goes to set them free, but Owen is against it. Claire doesn't do it and is resolved to let them die but Maisie isn't and opens the doors anyway. Thereby releasing the dinosaurs out into the world.\n\nLater, Owen says goodbye to Blue before she ventures out into the wilderness. Through those events, Owen renew his relationship with Claire and decided to adopt Maisie as their daughter. Owen, Claire, and Maisie were later seen driving down a high way to an unknown destination."
            },
            {
                "id": 3,
                "movie": "Jurassic World: Dominion",
                "sceneDescription": "For the next two years, they have been raising Maisie in secret at his finished isolated cabin in Sierra Nevada. Although they understand Maisie's frustration and wanting answers about her biological mother, Owen and Claire not only wanted to keep their daughter safe but also couldn't give her the answer she wanted because they don't know Charlotte well. One day, Owen reunited with Blue as he and Maisie find out that she had a baby, as his daughter named her Beta. Owen calmed an overprotective Blue down as she and her baby left the cabin. However, wanting to be sure no one was around, Owen decided to take a look in the area and told Maisie to stay at the cabin, but she disobeyed and left the area. Owen then witness Beta and Maisie getting kidnapped by Biosyn. After Blue found out about Beta's capture, Owen promised his old friend that he'll get her daughter back no matter what.\n\nOwen and Claire leave their cabin to rescue Maisie and Beta. Through the help of their old friends, Owen and Claire tracked them in Malta where the dinosaur smuggling ring happens. He confronted Maisie's kidnapper Rainn Delacourt into where Maisie and Beta are, who only reveals that lead dinosaur smuggler Soyona Santos knows where they are before he was killed by loose dinosaurs. Through Claire's interrogation of Santos, they found out that Maisie and Beta were taken to the Biosyn Research Facility in Dolomites mountain range in Italy. Owen and Claire get a ride to Biosyn from Kayla Watts. However, upon arriving, Owen and Kayla get separated from Claire as she ejected from the plane after a Quetzalcoatlus attack. After dealing with some of Biosyn's dinosaurs, Owen and Kayla reunite with Claire. Then, Owen, Kayla and Claire see a car got turned upside down near a research outpost. Hearing and seeing Maisie, who escaped, was inside as she gets out to see them, Owen and Claire embraced their daughter as they were relived that she was safe. However, much to his surprise, Owen sees three people exiting the car but recognized them as Dr. Ellie Sattler, Alan Grant, and Ian Malcolm from Jurassic Park. Hearing that Ellie, Alan and Ian were the ones who rescued and helped Maisie escape, Owen was extremely grateful to them for saving his daughter then asked the three if they were okay.\n\nHowever, the group were attacked by the Giganotosaurus from Biosyn, but managed to escape it. While regrouping, Owen gave some water to Ellie and Alan, then introduce himself to them. Also, Owen tells Alan that he's a fan of his book then became surprised that he and Ellie recognized him from Jurassic World. Wanting to keep his word to Blue, Owen, Alan, and Maisie went to go look for Beta, who escaped as well. After finding her and through the help of Maisie and Alan, Owen was able to knock Beta out and carries her on his back. Owen and the group encounter Henry Wu as he wants to leave with them and tells the group that he can fix what Biosyn has done. However, Owen and the group were skeptical of trusting Henry after everything he put them through but Maisie convinced them to give him a chance. After escaping Biosyn, Owen, Claire and Maisie bring Beta back to Blue.\n\nOwen took one last look at Blue alone as she came back to silently thank him for rescuing and bringing Beta back to her, then watched as his oldest friend leave for the wilderness once again. At their cabin, Owen and his family were at the campfire having s'mores together."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Owen_Grady"
    },
    {
        "id": 7,
        "name": "Claire Dearing",
        "role": "Jurassic World Operations",
        "movies": [
            "Jurassic World",
            "Jurassic World: Fallen Kingdom",
            "Jurassic World: Dominion"
        ],
        "movieScenes": [
            {
                "id": 1,
                "movie": "Jurassic World",
                "sceneDescription": "Sometime in June, her nephews, Zach and Gray, visited her and her workplace. As her job didn't allow her to spend a great deal of time with them, she had her assistant Zara look after them. She merely says she'll see them later tonight. Claire received Verizon Wireless investors who wanted to learn about the park's new attraction, a genetic hybrid named Indominus rex. After meeting her nephews at the Innovation Center, Claire received the visiting Jurassic World CEO Simon Masrani and brought him to the Indominus rex Paddock. Masrani asked her to bring in Owen to check the paddock for flaws, and she reluctantly went after the trainer, given their uneasy relationship. As they traveled to the paddock, she tried to call her nephews but got no response.\n\nAs they visit the paddock, the I. rex eventually escaped from captivity and went on a chaotic romp throughout the park. Claire returned to the Control Room. However, after seeing the first attempt at capturing the dinosaur fail, she requested an emergency shutdown of the park's attractions. Claire then learned that Zack and Gray weren't with her assistant Zara, so Claire called them and discovered they were on the Gyrosphere attraction. Once learning the boys were riding a sphere into the restricted area where the I. rex was loose, she decided to go after them, forcing her to again collaborate with Owen. While trailing the nephews, they found the Gyrosphere damaged and one of the Apatosaurus was wounded. Once they reached the abandoned Visitor Center, they figured the boys had fixed one of the Jurassic Park Jeeps to drive back to Jurassic World. Then they were attacked by the Indominus rex. They witnessed Masrani's helicopter be brought down by escaping pterosaurs from the Jurassic World Aviary and ran back to the park while Pteranodon and Dimorphodon flew above them.\n\nAfter reaching Main Street, Claire and Owen were attacked by a Dimorphodon that tried to carry Owen away, leading Claire to grab his rifle and shoot the pterosaur. Shortly afterward, she found her nephews and escorted them to safety in the Mobile Veterinarian Unit MVU-12. While watching Owen leading Blue and the rest of his Velociraptors to hunt the Indominus rex on her tablet, Claire witnessed the hybrid take control of the pack. An InGen Soldier warned them of the raptors and went to the back of the vehicle to try to get inside it. He was then attacked by Delta and Claire hit the accelerator and soon Echo smashed through the driver's window trying to kill Claire. The raptors pursued her vehicle, but Claire defeated them as she drove Echo into a tree in the pursuit, and her nephews tased Delta with a cattle prod when she tried to go inside the back of the vehicle. Afterward, they met up with Owen while driving on the road, who told her that they needed to go indoors. Claire then called Lowery to send in a rescue chopper.\n\nEntering the Hammond Creation Lab, Claire found that the InGen Security Division had commandeered the building, and Vic Hoskins revealed he had ordered the creation of the Indominus rex seeking a living weapon. While Vic discussed his plan with them, Delta entered the laboratory and killed Hoskins, causing Claire and her group to flee to Main Street. The group successfully escaped Delta when Gray used the Holoscape to project a Dilophosaurus to distract the raptor, but once outside, the group was met by the two surviving Velociraptors with Delta soon joining her other pack members. However, Owen convinced his raptor pack to attack the Indominus, but once Gray concludes they need more teeth to defeat the hybrid, Claire figures a solution. She calls Lowery Cruthers to open Paddock Nine, and uses a flare to attract Rexy; the park's veteran Tyrannosaurus into attacking the Indominus, eventually resulting in the hybrid's defeat via the Mosasaurus.\n\nAfter the evacuation, Claire was in a warehouse with the other survivors, reuniting with her sister and brother-in-law. She hugged Karen before leaving the nephews to their parents and went with Owen."
            },
            {
                "id": 2,
                "movie": "Jurassic World: Fallen Kingdom",
                "sceneDescription": "After the park closed, Claire founded the Dinosaur Protection Group to organize a rescue mission to save the dinosaurs of Isla Nublar from Mount Sibo's impending eruption that threatens to kill the remaining dinos. She is betrayed by Eli Mills and left to die on the island after he got what he wanted: Blue. She, Owen, and Franklin manage to escape by sneaking onto the boat as it's leaving the island. She learns that Mills only wanted the dinosaurs so that he could auction them off to the highest bidder. Owen and Claire head to Lockwood Manor planning to stop him but are caught by Mills' men. They're imprisoned among the dinosaurs and too late to stop the auction. They escape with the help of a Stygimoloch named Stiggy and run into Maisie Lockwood.\n\nTogether, they enter the auction room where the Indoraptor is being auctioned off. They agree that it can't be allowed to leave the grounds. Claire and Maisie watch as Owen, with the help of the Stygimoloch, ends the auction by force. Owen reunites with Claire and Maisie, but they run into an enraged Mills. They learn that Maisie is a clone of Benjamin Lockwood's daughter. Before Mills can have her and Owen killed, the Indoraptor attacks and kills the mercenaries with Mills, forcing him to retreat. The Indoraptor chases them around the main floor of Lockwood Manor. Claire is injured and encourages Owen to go after Maisie, whom the Indoraptor is pursuing. Later, Claire is on the rooftop with a gun pointed at the Indoraptor, poised to attack Owen. She encourages it to do so with the laser, and it almost falls through the glass roof. The Indoraptor manages to catch itself but does end up plummeting to its death after Blue jumps on it.\n\nZia and Franklin tell Claire that the dinosaurs are dying due to the broken ventilation; the only way to save them is to open the doors and let them run free. Claire goes to push the button to release them but hesitates and decides against it. Maisie ends up being the one to open the gates, letting the dinosaurs out into the world, which led to Rexy and a Carnotaurus killing Mills and destroying the Indominus rex bone sample. The group leaves the manor and says goodbye to Blue, who runs off into the North Californian wilderness. Through those events, Claire renew her relationship with Owen and decided to adopt Maisie as their daughter. Claire, Owen, and Maisie were later seen driving down the highway to an unknown destination."
            },
            {
                "id": 3,
                "movie": "Jurassic World: Dominion",
                "sceneDescription": "For the next two years, they continue to raise Maisie in secret in an isolated cabin in Sierra Nevada as they knew people were looking for her and Blue. Although they understand Maisie's frustration and wanting answers about her biological mother, Claire and Owen not only wanted to keep their daughter safe but also couldn't give her the answer she wanted because they didn't know Charlotte well. Also, Claire has been stopping illegal smuggling of dinosaurs with help from Franklin and Zia. However, Claire had to abandon her work because she and her friends were almost caught. Also, Claire understands that her friends got new job offers that they should take.\n\nOne day, after finding out that Blue had an offspring, Claire finds out through Owen that Biosyn kidnapped their old friend's child, as Maisie named her Beta, and their daughter. Claire and Owen leave their cabin to rescue Maisie and Beta. Through the help of their old friends, Claire and Owen tracked her in Malta where the dinosaur smuggling ring took place. She chased Soyona Santos and incapacitates her with a shock gun. Claire then interrogated her with it into where Maisie and Beta were being taken, which it's revealed that they are in the Biosyn Research Facility in Dolomites mountain range in Italy. Escaping an Atrociraptor attack, Claire and Owen get a ride to Biosyn from Kayla Watts. However, upon arriving, Claire gets separated from Owen and Kayla as she ejected from the plane after a Quetzalcoatlus attack. After dealing with some of Biosyn's dinosaurs, Claire reunited with Owen and Kayla. Then, Claire, Owen and Kayla see a car got turned upside down.\n\nHearing and seeing Maisie, who escaped, was inside as she gets out to see them, Claire and Owen embraced their daughter as they were relieved that she was safe. However, much to her surprise, Claire sees that Maisie already knew Kayla. Claire was more surprised to see three people exiting the car but recognized them as Dr. Ellie Sattler, Alan Grant, and Ian Malcolm from Jurassic Park. Hearing that Ellie, Alan and Ian were the ones who rescued and helped Maisie escape, Claire expressed her gratitude to them for saving her daughter. However, the group were attacked by a Giganotosaurus at a research outpost, but managed to escape it.\n\nWhile regrouping, Claire tended to Maisie then left to get the power back on with Ellie accompanying her. While getting to the power lines, Claire asked Ellie that she still get nightmares about her experience in Jurassic Park and she tells that she does. Claire then tells Ellie that she has a lot of regrets as she helps her see through her past mistakes that she had when she worked in Jurassic World. After getting the power back on, Claire and the group encounter Henry Wu as he wants to leave with them and tells the group that he can fix what Biosyn has done. However, Claire and the rest of the group were skeptical of trusting Henry after everything he put them through, but Maisie convinced them to give him a chance. After escaping Biosyn during the battle between the Giganotosaurus, Therizinosaurus, and Jurassic Park's veteran Tyrannosaurus, Claire, Owen and Maisie bring Beta back to Blue. Claire and her family were at their cabin doing a campfire and having s'mores together."
            }
        ],
        "link": "https://jurassicpark.fandom.com/wiki/Claire_Dearing"
    }
]
